{"sentiment": "Positive", "video_title": "What The Ultimate Study On Happiness Reveals", "video_id": "vSQjk9jKarg", "top_positive_comments": [{"text": "The key factor is not happiness, it&#39;s peacefulness. It doesn&#39;t matter if your an extrovert or introvert, married or unmarried, billionaire or broke. As long as your in peace then your okay. Our ancestors understood this and that&#39;s why on our tombstone it&#39;s written &quot;rest in peace&quot; instead of &quot;rest in happiness&quot;.", "like_count": 19}, {"text": "I am Abdulqais the son of Adhan Gidhifey. From Banu Abdulqais Family. I am a muslim.I would rather barry my feet on sand than bow to colonial imperialist.", "like_count": 2}, {"text": "&quot;I wish I hadn&#39;t spent more time at work, I wish I could have spent more time with the people I care about&quot;<br>Well, why do people work? To make money. Being financially secure is still an important factor in happiness and stress relief.", "like_count": 2}, {"text": "&quot;Married men live 12 years longer...&quot; 😂🤣 Yeah so clearly,  none of the researchers were married men", "like_count": 1}, {"text": "love me mom", "like_count": 1}], "top_negative_comments": [{"text": "It&#39;s not necessarily that having more money makes you happier, but that NOT having money makes you unhappy", "like_count": 3}, {"text": "Money means more freedom to do what you like", "like_count": 2}, {"text": "I wonder if the final interviews for those who are old is subjective by the fact that older people tend to think more about socializing because they know they dont have much time left. This study doesnt seem to cover the effect of perception on current age and how much time you have left. Younger people like me prefer fortune because reality is that you need it to make your older life more worthwhile, older people who said that relationships matter more are hypocrites because they already gathered enough fortune to retire and live a free style life. Its a matter about balancing wealth and relationships, and in my case also knowledge because I like science.<br>The problem is deeper routed into economics and financial health, our culture about businesses having the control about manpower and who gets hired needs to be replaced so that younger people does not have to think about fortune that much, because they know that it wont be as difficult as before and reality would not stop you from having both a good paying job and a relationship, alot of people gets screwed over by reality and society so if the effects of such a factor is minimized then people will think less of it, same thing with academics, I wanna get a doctorate which means that i will have less time to socialize, in my case I am an introvert so thats fine and I have other inanimate sources of joy in my life like doing my hobbies, anime, passion projects, programming and etc, but at the same time, my parents lost their job during the pandemic, we amount over a year&#39;s worth of debt after finally finding a job again, due to this I made a very dumb decision to go a less well known university to save money, only to realize that my curiosity and passion for learning is being held back by inferior education quality, even after transferring to a better university, it stills weighs on my mind that my parents can lose their jobs again anytime because they&#39;re getting old. Worse thing is that much more people suffered worse than me especially when theres not much &quot;good companies&quot; managed by &quot;the right people&quot; in the whole world while also having enough money to support family or do passion projects.", "like_count": 0}, {"text": "In this generation relationships is kinda risky and its gave us mental trauma", "like_count": 0}, {"text": "<a href=\"https://www.youtube.com/watch?v=vSQjk9jKarg&amp;t=1347\">22:27</a> that&#39;s it: I&#39;m joining a gym.\r<br>wait. I hate gyms; there&#39;s no gyms here and I have no money for it. damn it.", "like_count": 0}]}